print("Hello AI")

# 5+2의 결과를 출력
print(5+2)
# 3+8의 결과 출력
print(3+8)

# 숫자 18 출력
print(18)
# 2+6 계산 후 출력
print(2+6)
# '2+6'이라는 문자열 출력
print('2+6')

# 3+5
print(3+5)
# 3-5
print(3-5)
# 3x5
print(3*5)
# 3/5
print(3/5)
# 3%5   3을 5로 나눈 나머지
print(3%5)
# 3의 5제곱
print(3**5)

# 변수n에 '고양이' 대입
n = "고양이"
# 변수n 출력
print(n)
# 'n'이라는 문자열 출력
print('n')
# 변수 n에 3+7이라는 수식 대입
n = 3+7
# 변수 n을 출력
print(n)

m = "고양이"
print(m)
# 변수 m의 값을 '강아지'로 덮어쓰고 출력
m = '강아지'
print(m)
n = 14
print(n)
# 변수 n에 5를 곱하여 덮어쓰세요
n *= 5      # n = n*5
print(n)

# 변수 p에 '서울' 대입
p = '서울'
# 변수 p를 사용하여 '나는 서울 출신입니다.' 출력
print('나는'+ p + '출신입니다.')
